# SteelElemPatternTotalWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemPatternTotalWidth Property
ParameterTypeId Class See Also
---
"Length on side 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemPatternTotalWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemPatternTotalWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemPatternTotalWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace